## DataFrame function ##

# 06-08-2025 ---PRACTICE PROBLEM
1.shape
2.ndim
3.index
4.array
5.agg() or aggregate()
6.map()
7.dtype
8.size
9.astype()
10.apply()
11.groupby("column_name")["other_column_name"].operation_name(sum()).reset_index()
12.rolling(windows=number(1,2,3)).
13.how to add read and add to csv file json file and html file
14.dropna()
15.fillna()
17.rename()

## DataFrame

In [1]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
df1=pd.DataFrame(dict1)
df1

   numbers   names  prices  status
0        1    Ravi   12.50    True
1        2  Simran   14.75   False
2        3    Amit   10.00    True

In [2]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1

         numbers   names  prices  status
batch01        1    Ravi   12.50    True
batch02        2  Simran   14.75   False
batch03        3    Amit   10.00    True

In [3]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, batch01 to batch03
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   numbers  3 non-null      int64
 1   names    3 non-null      object
 2   prices   3 non-null      float64
 3   status   3 non-null      bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 99.0+ bytes

In [4]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.describe()

       numbers     prices
count      3.0   3.000000
mean       2.0  12.416667
std        1.0   2.376096
min        1.0  10.000000
25%        1.5  11.250000
50%        2.0  12.500000
75%        2.5  13.625000
max        3.0  14.750000

In [5]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.head(2)

         numbers   names  prices  status
batch01        1    Ravi   12.50    True
batch02        2  Simran   14.75   False

In [6]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.tail(2)

         numbers   names  prices  status
batch02        2  Simran   14.75   False
batch03        3    Amit   10.00    True

In [7]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.columns

Index(['numbers', 'names', 'prices', 'status'], dtype='object')

In [8]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.index

Index(['batch01', 'batch02', 'batch03'], dtype='object')

In [9]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
#indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1)
df1.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.values

array([[1, 'Ravi', 12.5, True],
       [2, 'Simran', 14.75, False],
       [3, 'Amit', 10.0, True]], dtype=object)

In [11]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.ndim

2

In [12]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1.shape

(3, 4)

In [21]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
print(df1["names"].dtype)

object

In [26]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
print(df1["numbers"].astype(float))

batch01    1.0
batch02    2.0
batch03    3.0
Name: numbers, dtype: float64

In [35]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
print(df1.size)
print("*"*10)
print(df1["prices"].size)

print("*="*20)

print(df1["status"].size)
print("*="*20)
print(df1.iloc[0].size)
print("*="*20)
print(df1)

12
**********
3
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
3
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
4
*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
         numbers   names  prices  status
batch01        1    Ravi   12.50    True
batch02        2  Simran   14.75   False
batch03        3    Amit   10.00    True

In [39]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1=df1["prices"].apply(lambda x:x*10)
df1

batch01    125.0
batch02    147.5
batch03    100.0
Name: prices, dtype: float64

In [38]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1["new_price"]=df1["prices"].apply(lambda x:x*10)
df1

         numbers   names  prices  status  new_price
batch01        1    Ravi   12.50    True      125.0
batch02        2  Simran   14.75   False      147.5
batch03        3    Amit   10.00    True      100.0

In [44]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
df1=pd.DataFrame(dict1)
indx=["batch01","batch02","batch03"]
filter_val=df1[df1["names"]=="Ravi"]
print(filter_val)

   numbers names  prices  status
0        1  Ravi    12.5    True

In [46]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
df1=pd.DataFrame(dict1)
indx=["batch01","batch02","batch03"]
filter_val=df1[df1["prices"]>13]
print(filter_val)

   numbers   names  prices  status
1        2  Simran   14.75   False

In [53]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
df1=pd.DataFrame(dict1)
indx=["batch01","batch02","batch03"]
filter_val=list(map(lambda x:x+10,df1["prices"]))
filter_val

[22.5, 24.75, 20.0]

In [55]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
filter_val=df1["prices"].map(lambda x:x+10)
filter_val

batch01    22.50
batch02    24.75
batch03    20.00
Name: prices, dtype: float64

In [58]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
filt=df1["status"].apply(lambda x:True if x==False else True)
filt

batch01    True
batch02    True
batch03    True
Name: status, dtype: bool

In [59]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
df1["new_status"]=df1["status"].apply(lambda x:True if x==False else True)
df1

         numbers   names  prices  status  new_status
batch01        1    Ravi   12.50    True        True
batch02        2  Simran   14.75   False        True
batch03        3    Amit   10.00    True        True

In [70]:
import pandas as pd
dict1 = {
    "numbers": [1, 2, 3],
    "names": ["Ravi", "Simran", "Amit"],
    "prices": [12.5, 14.75, 10.0],
    "status": [True, False, True]
}
indx=["batch01","batch02","batch03"]
df1=pd.DataFrame(dict1,index=indx)
filt=df1["status"].apply(lambda x : x is True)
filt

batch01     True
batch02    False
batch03     True
Name: status, dtype: bool

## 2.

In [71]:
mport pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
df2i

    ages   cities  scores  flags
01    21    Delhi    98.6  False
02    25   Mumbai    87.4  False
03    30  Chennai    91.2   True

In [75]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
df2.info()
print("="*40)
df2.describe()
print("="*40)
df2.head(1)
print("="*40)
df2.tail(2)
print("="*40)
df2["flags"].dtype
print("="*40)
df2.shape
print("="*40)
df2.size
print("="*40)
df2.index
print("="*40)
df2.ndim
print("="*40)
df2.columns

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 01 to 03
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ages    3 non-null      int64
 1   cities  3 non-null      object
 2   scores  3 non-null      float64
 3   flags   3 non-null      bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 99.0+ bytes
========================================
========================================
========================================
========================================
========================================
========================================
========================================
========================================
========================================

Index(['ages', 'cities', 'scores', 'flags'], dtype='object')

In [76]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
df2.describe()

            ages     scores
count   3.000000   3.000000
mean   25.333333  92.400000
std     4.509250   5.695612
min    21.000000  87.400000
25%    23.000000  89.300000
50%    25.000000  91.200000
75%    27.500000  94.900000
max    30.000000  98.600000

In [77]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
df2.columns

Index(['ages', 'cities', 'scores', 'flags'], dtype='object')

In [79]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
df2.iloc[[0],[1]]

   cities
01  Delhi

In [86]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
print(df2.loc["01","flags"])

False

In [87]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
df2.shape

(3, 4)

In [90]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
df2["ages"].size

3

In [91]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
filt1=df2["scores"].apply(lambda x:x>89)
filt1

01     True
02    False
03     True
Name: scores, dtype: bool

In [92]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
filt2=df2["scores"].apply(lambda x: x if x>89 else False)
filt2

01     98.6
02    False
03     91.2
Name: scores, dtype: object

In [93]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
df2["above_value"]=df2["scores"].apply(lambda x: x if x>89 else False)
df2

    ages   cities  scores  flags above_value
01    21    Delhi    98.6  False        98.6
02    25   Mumbai    87.4  False       False
03    30  Chennai    91.2   True        91.2

In [94]:
import pandas as pd
dict2 = {
    "ages": [21, 25, 30],
    "cities": ["Delhi", "Mumbai", "Chennai"],
    "scores": [98.6, 87.4, 91.2],
    "flags": [False, False, True]
}
idx=["01","02","03"]
df2=pd.DataFrame(dict2,index=idx)
def scores_rate(score):
    if score>=95:
        return "Excellent"
    elif score>=85:
        return "Very Good"
    else:
        return "Good"
df2["score_frame"]=df2["scores"].apply(scores_rate)
df2

    ages   cities  scores  flags score_frame
01    21    Delhi    98.6  False   Excellent
02    25   Mumbai    87.4  False   Very Good
03    30  Chennai    91.2   True   Very Good

In [97]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3

    books  copies  price_per_copy  in_stock
0  Python     100          299.99      True
1    Java     150          349.50      True
2     C++      80          275.75     False
3  cotlin      29           99.12      True

In [98]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   books           4 non-null      object
 1   copies          4 non-null      int64
 2   price_per_copy  4 non-null      float64
 3   in_stock        4 non-null      bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 232.0+ bytes

In [99]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3.describe()

           copies  price_per_copy
count    4.000000        4.000000
mean    89.750000      256.090000
std     50.069119      109.054626
min     29.000000       99.120000
25%     67.250000      231.592500
50%     90.000000      287.870000
75%    112.500000      312.367500
max    150.000000      349.500000

In [100]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3.head(2)

    books  copies  price_per_copy  in_stock
0  Python     100          299.99      True
1    Java     150          349.50      True

In [101]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3.tail(1)

    books  copies  price_per_copy  in_stock
3  cotlin      29           99.12      True

In [102]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3.index

RangeIndex(start=0, stop=4, step=1)

In [103]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3.columns

Index(['books', 'copies', 'price_per_copy', 'in_stock'], dtype='object')

In [104]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3.shape

(4, 4)

In [106]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3["copies"].size

4

In [107]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3.ndim

2

In [112]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
print(df3["in_stock"].dtype)

bool

In [113]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3["in_stock"].astype(int)

0    1
1    1
2    0
3    1
Name: in_stock, dtype: int64

In [114]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
def price_increment(price):
    if price<=350:
        return price+20
    else:
        price
df3["new_price_per_copy"]=df3["price_per_copy"].apply(price_increment)
df3

    books  copies  price_per_copy  in_stock  new_price_per_copy
0  Python     100          299.99      True              319.99
1    Java     150          349.50      True              369.50
2     C++      80          275.75     False              295.75
3  cotlin      29           99.12      True              119.12

In [115]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3["new_copies"]=df3["copies"].map(lambda x:x*10)
df3

    books  copies  price_per_copy  in_stock  new_copies
0  Python     100          299.99      True        1000
1    Java     150          349.50      True        1500
2     C++      80          275.75     False         800
3  cotlin      29           99.12      True         290

In [116]:
import pandas as pd
dict3 = {
    "books": ["Python", "Java", "C++","cotlin"],
    "copies": [100, 150, 80,29],
    "price_per_copy": [299.99, 349.50, 275.75,99.12],
    "in_stock": [True, True, False,True]
}
df3=pd.DataFrame(dict3)
df3

    books  copies  price_per_copy  in_stock
0  Python     100          299.99      True
1    Java     150          349.50      True
2     C++      80          275.75     False
3  cotlin      29           99.12      True

In [117]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4

   emp_id    name department  salary  experience_years  is_permanent
0     101    Ravi         HR   45000                 2          True
1     102  Simran         IT   60000                 4          True
2     103    Amit    Finance   55000                 5         False
3     104    Neha         IT   62000                 3          True
4     105  Vikram         HR   47000                 2         False
5     106  Anjali    Finance   58000                 6          True
6     107   Karan  Marketing   49000                 1         False
7     108   Priya         IT   61000                 3          True

In [118]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   emp_id            8 non-null      int64
 1   name              8 non-null      object
 2   department        8 non-null      object
 3   salary            8 non-null      int64
 4   experience_years  8 non-null      int64
 5   is_permanent      8 non-null      bool
dtypes: bool(1), int64(3), object(2)
memory usage: 460.0+ bytes

In [119]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.describe()

          emp_id        salary  experience_years
count    8.00000      8.000000          8.000000
mean   104.50000  54625.000000          3.250000
std      2.44949   6738.747234          1.669046
min    101.00000  45000.000000          1.000000
25%    102.75000  48500.000000          2.000000
50%    104.50000  56500.000000          3.000000
75%    106.25000  60250.000000          4.250000
max    108.00000  62000.000000          6.000000

In [120]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.head(3)

   emp_id    name department  salary  experience_years  is_permanent
0     101    Ravi         HR   45000                 2          True
1     102  Simran         IT   60000                 4          True
2     103    Amit    Finance   55000                 5         False

In [121]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.tail(3)

   emp_id    name department  salary  experience_years  is_permanent
5     106  Anjali    Finance   58000                 6          True
6     107   Karan  Marketing   49000                 1         False
7     108   Priya         IT   61000                 3          True

In [122]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.index

RangeIndex(start=0, stop=8, step=1)

In [123]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4["emp_id"].index

RangeIndex(start=0, stop=8, step=1)

In [124]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.loc[2,"department"]

'Finance'

In [126]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.iloc[0,1]

'Ravi'

In [127]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.columns

Index(['emp_id', 'name', 'department', 'salary', 'experience_years',
       'is_permanent'],
      dtype='object')

In [138]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.shape

(8, 6)

In [139]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4.size

48

In [142]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
print(df4["name"].dtype)

object

In [143]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4["is_permanent"].astype(float)

0    1.0
1    1.0
2    0.0
3    1.0
4    0.0
5    1.0
6    0.0
7    1.0
Name: is_permanent, dtype: float64

In [144]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4=df4["salary"].map(lambda x:x//10)
df4

0    4500
1    6000
2    5500
3    6200
4    4700
5    5800
6    4900
7    6100
Name: salary, dtype: int64

In [146]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4["decreased_salary"]=df4["salary"].map(lambda x:x//10)
df4

,emp_id,name,department,salary,experience_years,is_permanent,decreased_salary
0,101,Ravi,HR,45000,2,True,4500
1,102,Simran,IT,60000,4,True,6000
2,103,Amit,Finance,55000,5,False,5500
3,104,Neha,IT,62000,3,True,6200
4,105,Vikram,HR,47000,2,False,4700
5,106,Anjali,Finance,58000,6,True,5800
6,107,Karan,Marketing,49000,1,False,4900
7,108,Priya,IT,61000,3,True,6100

In [154]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
df4["It_field_emp"]=df4["department"].apply(lambda x:x if x=="IT" else None)
df4

,emp_id,name,department,salary,experience_years,is_permanent,It_field_emp
0,101,Ravi,HR,45000,2,True,None
1,102,Simran,IT,60000,4,True,IT
2,103,Amit,Finance,55000,5,False,None
3,104,Neha,IT,62000,3,True,IT
4,105,Vikram,HR,47000,2,False,None
5,106,Anjali,Finance,58000,6,True,None
6,107,Karan,Marketing,49000,1,False,None
7,108,Priya,IT,61000,3,True,IT

In [159]:
import pandas as pd
employee_data = {
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
}
df4=pd.DataFrame(employee_data)
def dep_It(department):
    if department=="IT":
        return department
   
    
df4["dep_It"]=df4["department"].apply(dep_It)
df4

   emp_id    name department  salary  experience_years  is_permanent dep_It
0     101    Ravi         HR   45000                 2          True   None
1     102  Simran         IT   60000                 4          True     IT
2     103    Amit    Finance   55000                 5         False   None
3     104    Neha         IT   62000                 3          True     IT
4     105  Vikram         HR   47000                 2         False   None
5     106  Anjali    Finance   58000                 6          True   None
6     107   Karan  Marketing   49000                 1         False   None
7     108   Priya         IT   61000                 3          True     IT

In [162]:
import pandas as pd
dict6={
    "maths": [80, 90, 70],
    "science": [85, 95, 75]
}
df5=pd.DataFrame(dict6)
print(df5.agg(["sum","mean"]))

      maths  science
sum   240.0    255.0
mean   80.0     85.0

In [167]:
import pandas as pd
dict6={
    "maths": [80, 90, 70],
    "science": [85, 95, 75]
}
df5=pd.DataFrame(dict6)
print(df5.agg(["sum","min"]))

     maths  science
sum    240      255
min     70       75

## 07-08-2025

In [2]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee_df

   emp_id    name department  salary  experience_years  is_permanent
0     101    Ravi         HR   45000                 2          True
1     102  Simran         IT   60000                 4          True
2     103    Amit    Finance   55000                 5         False
3     104    Neha         IT   62000                 3          True
4     105  Vikram         HR   47000                 2         False
5     106  Anjali    Finance   58000                 6          True
6     107   Karan  Marketing   49000                 1         False
7     108   Priya         IT   61000                 3          True

In [3]:
employee_df.describe()

          emp_id        salary  experience_years
count    8.00000      8.000000          8.000000
mean   104.50000  54625.000000          3.250000
std      2.44949   6738.747234          1.669046
min    101.00000  45000.000000          1.000000
25%    102.75000  48500.000000          2.000000
50%    104.50000  56500.000000          3.000000
75%    106.25000  60250.000000          4.250000
max    108.00000  62000.000000          6.000000

In [4]:
employee_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   emp_id            8 non-null      int64
 1   name              8 non-null      object
 2   department        8 non-null      object
 3   salary            8 non-null      int64
 4   experience_years  8 non-null      int64
 5   is_permanent      8 non-null      bool
dtypes: bool(1), int64(3), object(2)
memory usage: 460.0+ bytes

In [5]:
employee_df.head(2)

   emp_id    name department  salary  experience_years  is_permanent
0     101    Ravi         HR   45000                 2          True
1     102  Simran         IT   60000                 4          True

In [6]:
employee_df.tail(3)

   emp_id    name department  salary  experience_years  is_permanent
5     106  Anjali    Finance   58000                 6          True
6     107   Karan  Marketing   49000                 1         False
7     108   Priya         IT   61000                 3          True

In [7]:
employee_df.index

RangeIndex(start=0, stop=8, step=1)

In [8]:
employee_df.shape

(8, 6)

In [9]:
employee_df.size

48

In [10]:
employee_df.columns

Index(['emp_id', 'name', 'department', 'salary', 'experience_years',
       'is_permanent'],
      dtype='object')

In [14]:
employee_df.values

array([[101, 'Ravi', 'HR', 45000, 2, True],
       [102, 'Simran', 'IT', 60000, 4, True],
       [103, 'Amit', 'Finance', 55000, 5, False],
       [104, 'Neha', 'IT', 62000, 3, True],
       [105, 'Vikram', 'HR', 47000, 2, False],
       [106, 'Anjali', 'Finance', 58000, 6, True],
       [107, 'Karan', 'Marketing', 49000, 1, False],
       [108, 'Priya', 'IT', 61000, 3, True]], dtype=object)

In [18]:
print(employee_df["salary"].array)

<NumpyExtensionArray>
[np.int64(45000), np.int64(60000), np.int64(55000), np.int64(62000),
 np.int64(47000), np.int64(58000), np.int64(49000), np.int64(61000)]
Length: 8, dtype: int64

In [19]:
employee_df["salary"].dtype

dtype('int64')

In [20]:
employee_df["salary"].astype(float)

0    45000.0
1    60000.0
2    55000.0
3    62000.0
4    47000.0
5    58000.0
6    49000.0
7    61000.0
Name: salary, dtype: float64

In [22]:
print(employee_df.loc[2,"salary"])

55000

In [25]:
employee_df.iloc[[1,2],[4,2]]

   experience_years department
1                 4         IT
2                 5    Finance

In [33]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
#employee_df
employee_df=employee_df["salary"].map(lambda x:x*10)
print(employee_df)

0    450000
1    600000
2    550000
3    620000
4    470000
5    580000
6    490000
7    610000
Name: salary, dtype: int64

In [32]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee_df["new_salary"]=employee_df["salary"].map(lambda x:x*10)
employee_df

,emp_id,name,department,salary,experience_years,is_permanent,new_salary
0,101,Ravi,HR,45000,2,True,450000
1,102,Simran,IT,60000,4,True,600000
2,103,Amit,Finance,55000,5,False,550000
3,104,Neha,IT,62000,3,True,620000
4,105,Vikram,HR,47000,2,False,470000
5,106,Anjali,Finance,58000,6,True,580000
6,107,Karan,Marketing,49000,1,False,490000
7,108,Priya,IT,61000,3,True,610000

In [34]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee_df["HR_Department"]=employee_df["department"].apply(lambda x:x if x=="HR" else None)
employee_df

,emp_id,name,department,salary,experience_years,is_permanent,HR_Department
0,101,Ravi,HR,45000,2,True,HR
1,102,Simran,IT,60000,4,True,None
2,103,Amit,Finance,55000,5,False,None
3,104,Neha,IT,62000,3,True,None
4,105,Vikram,HR,47000,2,False,HR
5,106,Anjali,Finance,58000,6,True,None
6,107,Karan,Marketing,49000,1,False,None
7,108,Priya,IT,61000,3,True,None

In [37]:
max_salary=employee_df["salary"].agg("max")
max_salary

62000

In [44]:
max_salary,min_salary,mean_value=employee_df["salary"].agg((["max" ,"min" ,"mean"]))
max_salary,min_salary,mean_value

(62000.0, 45000.0, 54625.0)

In [50]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee1=employee_df.groupby("department")
employee1

In [51]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee1=employee_df.groupby("department")["salary"]
employee1

In [52]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee1=employee_df.groupby("department")["salary"].sum()
employee1

department
Finance      113000
HR            92000
IT           183000
Marketing     49000
Name: salary, dtype: int64

In [54]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee1=employee_df.groupby("department")["salary"].sum().reset_index()
employee1

  department  salary
0    Finance  113000
1         HR   92000
2         IT  183000
3  Marketing   49000

In [56]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee_df["total_salary_sum"]=employee_df.groupby("department")["salary"].sum().reset_index()
employee_df

ValueError: Cannot set a DataFrame with multiple columns to the single column total_salary_sum

In [83]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee2=employee_df.groupby("name")["experience_years"].mean().reset_index()
employee2

     name  experience_years
0    Amit               5.0
1  Anjali               6.0
2   Karan               1.0
3    Neha               3.0
4   Priya               3.0
5    Ravi               2.0
6  Simran               4.0
7  Vikram               2.0

In [65]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee_df["total_salary_sum"]=employee_df.groupby("department")["salary"].rolling(window=3)
employee_df

TypeError: object of type 'RollingGroupby' has no len()

In [73]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee2=employee_df.rolling(window=3)
employee2

Rolling [window=3,center=False,axis=0,method=single]

In [85]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee3=employee_df["salary"].rolling(window=3).sum()
employee3

0         NaN
1         NaN
2    160000.0
3    177000.0
4    164000.0
5    167000.0
6    154000.0
7    168000.0
Name: salary, dtype: float64

In [84]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee3=employee_df["salary"].rolling(window=3).sum().reset_index()
employee3

   index    salary
0      0       NaN
1      1       NaN
2      2  160000.0
3      3  177000.0
4      4  164000.0
5      5  167000.0
6      6  154000.0
7      7  168000.0

In [88]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee4=employee_df["salary"].tail(3).sum()
print(employee4)

168000

In [89]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee4=employee_df["salary"].head(3).sum()
print(employee4)

160000

In [93]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee4=employee_df.groupby("department")["salary"].sum().sort_values().reset_index()
employee4

  department  salary
0  Marketing   49000
1         HR   92000
2    Finance  113000
3         IT  183000

In [94]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee4=employee_df.groupby("department")["salary"].sum().sort_values(ascending=False).reset_index()
employee4

  department  salary
0         IT  183000
1    Finance  113000
2         HR   92000
3  Marketing   49000

In [99]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee4=employee_df.groupby("department")["salary"].value_counts().reset_index()
employee4

  department  salary  count
0    Finance   55000      1
1    Finance   58000      1
2         HR   45000      1
3         HR   47000      1
4         IT   60000      1
5         IT   61000      1
6         IT   62000      1
7  Marketing   49000      1

## HOW TO STORE DATA ON--
1.CSV FILE(.CSV)
2.JSON DATA(.JSON)
3.EXCEL FILE(.XLSX)

In [12]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee_df.to_csv("employee_data.csv",index=False)

In [13]:
employee_df.to_json("employee_data.json",index=False)

In [14]:
employee_df.to_excel("employee_data.xlsx",index=False)

In [21]:
employee_df.to_csv("c:/Users/talib/OneDrive/Desktop/employee_data.csv",index=False)

In [22]:
employee_df.to_json("c:/Users/talib/OneDrive/Desktop/employee_data.json",index=False)

In [23]:
employee_df.to_excel("c:/Users/talib/OneDrive/Desktop/employee_data.xlsx",index=False)

## HOW TO READ DATA ##

In [24]:
emp1=pd.read_csv("c:\\Users\\talib\\OneDrive\\Desktop\\employee_data.csv")
emp1

   emp_id    name department  salary  experience_years  is_permanent
0     101    Ravi         HR   45000                 2          True
1     102  Simran         IT   60000                 4          True
2     103    Amit    Finance   55000                 5         False
3     104    Neha         IT   62000                 3          True
4     105  Vikram         HR   47000                 2         False
5     106  Anjali    Finance   58000                 6          True
6     107   Karan  Marketing   49000                 1         False
7     108   Priya         IT   61000                 3          True

In [26]:
emp2=pd.read_json("c:\\Users\\talib\\OneDrive\\Desktop\\employee_data.json")
emp2

   emp_id    name department  salary  experience_years  is_permanent
0     101    Ravi         HR   45000                 2          True
1     102  Simran         IT   60000                 4          True
2     103    Amit    Finance   55000                 5         False
3     104    Neha         IT   62000                 3          True
4     105  Vikram         HR   47000                 2         False
5     106  Anjali    Finance   58000                 6          True
6     107   Karan  Marketing   49000                 1         False
7     108   Priya         IT   61000                 3          True

In [27]:
emp3=pd.read_excel("c:\\Users\\talib\\OneDrive\\Desktop\\employee_data.xlsx")
emp3

   emp_id    name department  salary  experience_years  is_permanent
0     101    Ravi         HR   45000                 2          True
1     102  Simran         IT   60000                 4          True
2     103    Amit    Finance   55000                 5         False
3     104    Neha         IT   62000                 3          True
4     105  Vikram         HR   47000                 2         False
5     106  Anjali    Finance   58000                 6          True
6     107   Karan  Marketing   49000                 1         False
7     108   Priya         IT   61000                 3          True

In [102]:
import pandas as pd
employee_df = pd.DataFrame({
    "emp_id": [101, 102, 103, 104, 105, 106, 107, 108],
    "name": ["Ravi", "Simran", "Amit", "Neha", "Vikram", "Anjali", "Karan", "Priya"],
    "department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "Marketing", "IT"],
    "salary": [45000, 60000, 55000, 62000, 47000, 58000, 49000, 61000],
    "experience_years": [2, 4, 5, 3, 2, 6, 1, 3],
    "is_permanent": [True, True, False, True, False, True, False, True]
})
employee4=employee_df.groupby("department")["salary"].value_counts().reset_index()
employee4

  department  salary  count
0    Finance   55000      1
1    Finance   58000      1
2         HR   45000      1
3         HR   47000      1
4         IT   60000      1
5         IT   61000      1
6         IT   62000      1
7  Marketing   49000      1

In [105]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_df

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,450
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,189
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,400

In [106]:
shopping_df.describe()

       Quantity  Price_per_unit  Total_Amount
count   5.00000        5.000000       5.00000
mean    5.00000       52.600000     247.80000
std     2.12132       28.953411     166.75491
min     3.00000       13.000000      96.00000
25%     3.00000       32.000000     104.00000
50%     5.00000       63.000000     189.00000
75%     6.00000       75.000000     400.00000
max     8.00000       80.000000     450.00000

In [107]:
shopping_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer        5 non-null      object
 1   Product         5 non-null      object
 2   Quantity        5 non-null      int64
 3   Price_per_unit  5 non-null      int64
 4   Store           5 non-null      object
 5   Payment_Method  5 non-null      object
 6   Date            5 non-null      object
 7   Total_Amount    5 non-null      int64
dtypes: int64(3), object(5)
memory usage: 452.0+ bytes

In [108]:
shopping_df.head(3)

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,450
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,189
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96

In [109]:
shopping_df.tail(3)

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,400

In [110]:
shopping_df.shape

(5, 8)

In [111]:
shopping_df.size

40

In [112]:
shopping_df.index

RangeIndex(start=0, stop=5, step=1)

In [113]:
shopping_df.columns

Index(['Customer', 'Product', 'Quantity', 'Price_per_unit', 'Store',
       'Payment_Method', 'Date', 'Total_Amount'],
      dtype='object')

In [115]:
shopping_df.loc[2,"Product"]

'Rice'

In [116]:
shopping_df.iloc[[1,3],[2,3]]

   Quantity  Price_per_unit
1         3              63
3         8              13

In [117]:
shopping_df["Quantity"].dtype

dtype('int64')

In [118]:
shopping_df["Quantity"].astype(float)

0    6.0
1    3.0
2    3.0
3    8.0
4    5.0
Name: Quantity, dtype: float64

In [120]:
shopping_df["Quantity"].array

<NumpyExtensionArray>
[np.int64(6), np.int64(3), np.int64(3), np.int64(8), np.int64(5)]
Length: 5, dtype: int64

In [121]:
shopping_df.ndim

2

In [122]:
shopping_list=shopping_df["Quantity"].agg(("sum","min","max","mean"))
shopping_list

sum     25.0
min      3.0
max      8.0
mean     5.0
Name: Quantity, dtype: float64

In [123]:
shopp1=shopping_df["Quantity"].map(lambda x:x*10)
shopp1

0    60
1    30
2    30
3    80
4    50
Name: Quantity, dtype: int64

In [124]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_df["Payment"]=shopping_df["Payment_Method"].apply(lambda x: x if x=="Cash" else None)
shopping_df

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,Payment
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,450,Cash
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,189,None
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96,Cash
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104,None
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,400,Cash

In [130]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_2=shopping_df.groupby("Product")["Quantity"].value_counts().reset_index()
shopping_2

  Product  Quantity  count
0    Rice         3      1
1    Rice         6      1
2   Sugar         3      1
3   Sugar         8      1
4     dal         5      1

In [133]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_3=shopping_df.groupby("Price_per_unit")["Total_Amount"].sum().reset_index()
shopping_3

   Price_per_unit  Total_Amount
0              13           104
1              32            96
2              63           189
3              75           450
4              80           400

In [137]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_3=shopping_df.groupby("Price_per_unit")["Total_Amount"].sum().sort_values(ascending=False).reset_index()
shopping_3

   Price_per_unit  Total_Amount
0              75           450
1              80           400
2              63           189
3              13           104
4              32            96

In [140]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_4=shopping_df["Total_Amount"].rolling(window=3).sum().reset_index()
shopping_4

   index  Total_Amount
0      0           NaN
1      1           NaN
2      2         735.0
3      3         389.0
4      4         600.0

In [150]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_5=shopping_df["Quantity"].rolling(window=3).mean().reset_index()
print("Avg. Quantity needed :")
shopping_5

Avg. Quantity needed :

   index  Quantity
0      0       NaN
1      1       NaN
2      2  4.000000
3      3  4.666667
4      4  5.333333

Show all entries where Payment_Method is "Cash".

List all products bought by customer "Nisha".

Filter all transactions from store "Smart Store".

In [153]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
def payment_method(payment):
    if payment=="Cash":
        return payment
shopping_6=shopping_df["Payment_Method"].apply(payment_method).reset_index()
shopping_6

   index Payment_Method
0      0           Cash
1      1           None
2      2           Cash
3      3           None
4      4           Cash

In [156]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_df["Cash_Payment"]=shopping_df["Payment_Method"].apply(lambda x: x if x=="Cash" else None)
shopping_df

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,Cash_Payment
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,450,Cash
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,189,None
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96,Cash
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104,None
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,400,Cash

In [165]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_6=shopping_df[shopping_df["Customer"]=="Nisha"][["Customer","Product"]]
shopping_6

  Customer Product
1    Nisha   Sugar
2    Nisha    Rice

In [166]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_6=shopping_df[shopping_df["Store"]=="Daily Mart"][["Customer","Product","Quantity","Total_Amount"]]
shopping_6

  Customer Product  Quantity  Total_Amount
1    Nisha   Sugar         3           189

In [168]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_7=shopping_df["Total_Amount"].rolling(window=2).mean().reset_index()
shopping_7

   index  Total_Amount
0      0           NaN
1      1         319.5
2      2         142.5
3      3         100.0
4      4         252.0

In [175]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_df=shopping_df.groupby("Product")['Price_per_unit'].sum().reset_index()
shopping_df

  Product  Price_per_unit
0    Rice             107
1   Sugar              76
2     dal              80

In [178]:
shopping_df.to_csv("shopping_df.csv",index=False)

In [184]:
shopping_df.to_csv("C:/Users/talib/OneDrive/Desktop/shopping_data.csv", index=False)

In [185]:
shopping_df.to_json("Shopping_df.json",index=False)

In [186]:
shopping_df.to_json("C:/Users/talib/OneDrive/Desktop/shopping_data.json",index=False)

In [2]:
import pandas as pd
shopping_df =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_df.to_excel("Shopping_df.xlsx",index=False)

In [5]:
shopping_df.to_excel("C:/Users/talib/OneDrive/Desktop/shopping_data.xlsx",index=False)

In [9]:
shopping_df=pd.read_csv("c:\\Users\\talib\\OneDrive\\Desktop\\shopping_data.csv")

In [10]:
shopping_df

  Product  Price_per_unit
0    Rice             107
1   Sugar              76
2     dal              80

## 08-08-2025
1.dropna()
2.fillna()
3.rename()
4.import os

In [2]:
import pandas as pd
shopping_df1 =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', 'dal'],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13, 80],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450, 189, 96, 104, 400]
})
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,450
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,189
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,400

In [3]:
shopping_df1.head(2)

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,450
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,189

In [4]:
shopping_df1.tail(3)

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,400

In [11]:
shopping_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer        5 non-null      object
 1   Product         5 non-null      object
 2   Quantity        5 non-null      int64
 3   Price_per_unit  5 non-null      int64
 4   Store           5 non-null      object
 5   Payment_Method  5 non-null      object
 6   Date            5 non-null      object
 7   Total_Amount    5 non-null      int64
dtypes: int64(3), object(5)
memory usage: 452.0+ bytes

In [12]:
shopping_df1.describe()

       Quantity  Price_per_unit  Total_Amount
count   5.00000        5.000000       5.00000
mean    5.00000       52.600000     247.80000
std     2.12132       28.953411     166.75491
min     3.00000       13.000000      96.00000
25%     3.00000       32.000000     104.00000
50%     5.00000       63.000000     189.00000
75%     6.00000       75.000000     400.00000
max     8.00000       80.000000     450.00000

In [13]:
shopping_df1.ndim

2

In [14]:
shopping_df1.size

40

In [15]:
shopping_df1.shape

(5, 8)

In [17]:
shopping_df1["Store"].dtype

dtype('O')

In [30]:
shopping_df1["Total_Amount"]=shopping_df1["Total_Amount"].astype("int8" )
shopping_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer        5 non-null      object
 1   Product         5 non-null      object
 2   Quantity        5 non-null      int64
 3   Price_per_unit  5 non-null      int64
 4   Store           5 non-null      object
 5   Payment_Method  5 non-null      object
 6   Date            5 non-null      object
 7   Total_Amount    5 non-null      int8
dtypes: int64(2), int8(1), object(5)
memory usage: 417.0+ bytes

In [32]:
print(shopping_df1["Total_Amount"].max())
shopping_df1

104

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,-62
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,-67
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,-112

In [40]:
shopping_df1["Total_Amount"]=shopping_df1["Total_Amount"].astype("int16" )
shopping_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer        5 non-null      object
 1   Product         5 non-null      object
 2   Quantity        5 non-null      int64
 3   Price_per_unit  5 non-null      int64
 4   Store           5 non-null      object
 5   Payment_Method  5 non-null      object
 6   Date            5 non-null      object
 7   Total_Amount    5 non-null      int16
dtypes: int16(1), int64(2), object(5)
memory usage: 422.0+ bytes

In [43]:
 shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,-62
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,-67
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,-112

In [42]:
shopping_df1.loc[1,"Product"]

'Sugar'

In [45]:
shopping_df1.iloc[1,2]

np.int64(3)

In [47]:
shopping_df1.iloc[[2,2],[3,2]]

   Price_per_unit  Quantity
2              32         3
2              32         3

In [48]:
shopping_df1.iloc[[1,0],[1,3]]

  Product  Price_per_unit
1   Sugar              63
0    Rice              75

In [44]:
shopping_df1.loc[[1,"Product"],[2,"Quantity"]]

KeyError: "['Product'] not in index"

In [49]:
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,-62
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,-67
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,-112

In [50]:
shopping_df1.ndim

2

In [51]:
shopping_df1.columns

Index(['Customer', 'Product', 'Quantity', 'Price_per_unit', 'Store',
       'Payment_Method', 'Date', 'Total_Amount'],
      dtype='object')

In [54]:
shopping_df1.nunique().reset_index()

            index  0
0        Customer  4
1         Product  3
2        Quantity  4
3  Price_per_unit  5
4           Store  5
5  Payment_Method  2
6            Date  5
7    Total_Amount  5

In [56]:
shopping_df1["Total_Amount"].array

<NumpyExtensionArray>
[np.int16(-62), np.int16(-67), np.int16(96), np.int16(104), np.int16(-112)]
Length: 5, dtype: int16

In [58]:
amount=shopping_df1["Total_Amount"].map(lambda x:x*10)
amount

0    -620
1    -670
2     960
3    1040
4   -1120
Name: Total_Amount, dtype: int64

In [60]:
shopping_df1["Total_Amount"]=shopping_df1["Total_Amount"].map(lambda x:x*10)
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,new_quant
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,-620,12
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,-670,6
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,960,6
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,1040,16
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,-1120,10

In [59]:
shopping_df1["new_quant"]=shopping_df1["Quantity"].apply(lambda x:x*2)
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,new_quant
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,-62,12
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,-67,6
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,96,6
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,104,16
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,-112,10

In [62]:
pro_name=shopping_df1.groupby("Customer")["Product"].sum().reset_index()
pro_name

  Customer    Product
0    Nisha  SugarRice
1    Priya      Sugar
2      Raj       Rice
3    talib        dal

In [126]:
shopping1=shopping_df1.groupby("Product")["Quantity"].mean().reset_index()
shopping1

  Product  Quantity
0    Rice       4.5
1   Sugar       5.5
2     dal       5.0

In [129]:
shopping2=shopping_df1["Total_Amount"].rolling(window=3).sum().reset_index()
shopping2

   index  Total_Amount
0      0           NaN
1      1           NaN
2      2        -330.0
3      3        1330.0
4      4         880.0

In [133]:
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,new_quant
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,-620,12
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,-670,6
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,960,6
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,1040,16
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,-1120,10

In [135]:
shopping_name=shopping_df1["Customer"].rename().reset_index()
shopping_name

   index      0
0      0    Raj
1      1  Nisha
2      2  Nisha
3      3  Priya
4      4  talib

In [138]:
shopping_name1=shopping_df1.rename(columns={"Customer":"Name"})
shopping_name1

,Name,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,new_quant
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,-620,12
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,-670,6
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,960,6
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,1040,16
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,-1120,10

In [141]:
shopping_df1.rename(columns={"Payment_Method":"Payment"})

,Customer,Product,Quantity,Price_per_unit,Store,Payment,Date,Total_Amount,new_quant
0,Raj,Rice,6,75,Kirana Express,Cash,2025-08-01,-620,12
1,Nisha,Sugar,3,63,Daily Mart,UPI,2025-08-02,-670,6
2,Nisha,Rice,3,32,Fresh Market,Cash,2025-08-03,960,6
3,Priya,Sugar,8,13,Bitthal_Market,UPI,2025-08-04,1040,16
4,talib,dal,5,80,Govindpura,Cash,2025-08-05,-1120,10

In [143]:
ind=["o1","02","03","04","05"]
shopping1=pd.DataFrame(shopping_df1,index=ind)
shopping1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,new_quant
o1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [144]:
shopping1.dropna()

Empty DataFrame
Columns: [Customer, Product, Quantity, Price_per_unit, Store, Payment_Method, Date, Total_Amount, new_quant]
Index: []

In [155]:
shopping1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,new_quant
o1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [151]:
shop2=shopping1["Quantity"].fillna("0")
shop2

o1    0
02    0
03    0
04    0
05    0
Name: Quantity, dtype: object

In [156]:
shopping1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,new_quant
o1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [152]:
shop2=shopping1["Customer"].fillna("Unknown")
shop2

o1    Unknown
02    Unknown
03    Unknown
04    Unknown
05    Unknown
Name: Customer, dtype: object

In [158]:
shopping1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount,new_quant
o1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [75]:
import pandas as pd
df1=pd.read_csv(r"C:\Users\talib\Downloads\student_marks.csv",index_col=0)
df1

          Name  Marks Grade
Index
1        Alice     85     B
2          Bob     78     C
3      Charlie     92     A
4        David     67     D
5          Eva     88     B
6        Frank     73     C
7        Grace     95     A
8       Hannah     89     B
9          Ian     76     C
10        Jack     82     B
11       Karen     91     A
12         Leo     68     D
13        Mona     84     B
14        Nina     77     C
15       Oscar     69     D
16         Pam     90     A
17       Quinn     87     B
18      Rachel     74     C
19       Steve     79     C
20        Tina     93     A
21         Uma     65     D
22      Victor     80     B
23       Wendy     86     B
24      Xavier     70     C
25        Yara     94     A

In [86]:
import pandas as pd
df2=pd.DataFrame({
    "Cricket":["IPL","ICC","COUNTY","DLT"],
    "Crickter":["Virat","Rohit","Dhoni","Jadeja"],
    "Ball":["Cuccobora","Dusky","Tennis","Leather"],
    "Bat_Price":[1000,2000,3500,9000],
    "Players":[11,2,3,4]
})
df2
df2.to_csv("cricket_details.csv",index=False)

In [89]:
df3=pd.read_csv("cricket_details.csv",index_col=0)
df3

        Crickter       Ball  Bat_Price  Players
Cricket
IPL        Virat  Cuccobora       1000       11
ICC        Rohit      Dusky       2000        2
COUNTY     Dhoni     Tennis       3500        3
DLT       Jadeja    Leather       9000        4

In [92]:
df2.to_json("cricket_details_.json",index=False)

In [93]:
df2.to_excel("cricket_details.xlsx",index=False)

In [94]:
df2.to_excel("C:\\Users\\talib\\OneDrive\\Desktop\\cricket_details.xlsx",index=False)

In [119]:
read_excel=pd.read_excel("C:\\Users\\talib\\OneDrive\\Desktop\\cricket_details.xlsx")
read_excel

  Cricket Crickter       Ball  Bat_Price  Players
0     IPL    Virat  Cuccobora       1000       11
1     ICC    Rohit      Dusky       2000        2
2  COUNTY    Dhoni     Tennis       3500        3
3     DLT   Jadeja    Leather       9000        4

In [123]:
read_excel=pd.read_excel("C:\\Users\\talib\\OneDrive\\Desktop\\cricket_details.xlsx",index_col=0)
read_excel

        Crickter       Ball  Bat_Price  Players
Cricket
IPL        Virat  Cuccobora       1000       11
ICC        Rohit      Dusky       2000        2
COUNTY     Dhoni     Tennis       3500        3
DLT       Jadeja    Leather       9000        4

In [95]:
df2.to_json("C:\\Users\\talib\\OneDrive\\Desktop\\cricket_details.json",index=False)

In [117]:
read_json=pd.read_json("C:\\Users\\talib\\OneDrive\\Desktop\\cricket_details.json")
read_json

  Cricket Crickter       Ball  Bat_Price  Players
0     IPL    Virat  Cuccobora       1000       11
1     ICC    Rohit      Dusky       2000        2
2  COUNTY    Dhoni     Tennis       3500        3
3     DLT   Jadeja    Leather       9000        4

In [118]:
read_json=pd.read_json("C:\\Users\\talib\\OneDrive\\Desktop\\cricket_details.json",index_col=0)
read_json

TypeError: read_json() got an unexpected keyword argument 'index_col'

In [99]:
df2.to_csv("C:\\Users\\talib\\Downloads\\cricket_details.csv",index=False)

In [105]:
read_csv=pd.read_csv("C:\\Users\\talib\\Downloads\\cricket_details.csv",index_col=0)
read_csv

        Crickter       Ball  Bat_Price  Players
Cricket
IPL        Virat  Cuccobora       1000       11
ICC        Rohit      Dusky       2000        2
COUNTY     Dhoni     Tennis       3500        3
DLT       Jadeja    Leather       9000        4

In [110]:
read_csv=pd.read_csv("C:\\Users\\talib\\Downloads\\cricket_details.csv",index_col=2)
read_csv

          Cricket Crickter  Bat_Price  Players
Ball
Cuccobora     IPL    Virat       1000       11
Dusky         ICC    Rohit       2000        2
Tennis     COUNTY    Dhoni       3500        3
Leather       DLT   Jadeja       9000        4

In [159]:
df2

  Cricket Crickter       Ball  Bat_Price  Players
0     IPL    Virat  Cuccobora       1000       11
1     ICC    Rohit      Dusky       2000        2
2  COUNTY    Dhoni     Tennis       3500        3
3     DLT   Jadeja    Leather       9000        4

In [162]:
df2["Cricket"].unique()

array(['IPL', 'ICC', 'COUNTY', 'DLT'], dtype=object)

In [164]:
df2.nunique().reset_index()

       index  0
0    Cricket  4
1   Crickter  4
2       Ball  4
3  Bat_Price  4
4    Players  4

In [167]:
two_column=df2.groupby("Bat_Price")["Players"].sum().reset_index()
two_column

   Bat_Price  Players
0       1000       11
1       2000        2
2       3500        3
3       9000        4

In [168]:
add_value=df2["Bat_Price"].rolling(window=2).sum().reset_index()
add_value

   index  Bat_Price
0      0        NaN
1      1     3000.0
2      2     5500.0
3      3    12500.0

In [169]:
df2["New_Price"]=df2["Bat_Price"].rolling(window=2).sum().reset_index()
df2

ValueError: Cannot set a DataFrame with multiple columns to the single column New_Price

In [170]:
rename_df=df2.rename(columns={"Cricketer":"Players","Bat_Price":"Bat_Value"})
rename_df

  Cricket Crickter       Ball  Bat_Value  Players
0     IPL    Virat  Cuccobora       1000       11
1     ICC    Rohit      Dusky       2000        2
2  COUNTY    Dhoni     Tennis       3500        3
3     DLT   Jadeja    Leather       9000        4

In [171]:
df2

  Cricket Crickter       Ball  Bat_Price  Players
0     IPL    Virat  Cuccobora       1000       11
1     ICC    Rohit      Dusky       2000        2
2  COUNTY    Dhoni     Tennis       3500        3
3     DLT   Jadeja    Leather       9000        4

In [172]:
df2.rename(columns={"Ball":"Ball_Play","Bat_Price":"Bat_Value"})

  Cricket Crickter  Ball_Play  Bat_Value  Players
0     IPL    Virat  Cuccobora       1000       11
1     ICC    Rohit      Dusky       2000        2
2  COUNTY    Dhoni     Tennis       3500        3
3     DLT   Jadeja    Leather       9000        4

In [173]:
df2

  Cricket Crickter       Ball  Bat_Price  Players
0     IPL    Virat  Cuccobora       1000       11
1     ICC    Rohit      Dusky       2000        2
2  COUNTY    Dhoni     Tennis       3500        3
3     DLT   Jadeja    Leather       9000        4

In [190]:
import pandas as pd
shopping_df1 =pd.DataFrame({
    'Customer': ['Raj', 'Nisha', 'Nisha', 'Priya', 'talib'],
    'Product': ['Rice', 'Sugar', 'Rice', 'Sugar', None],
    'Quantity': [6, 3, 3, 8, 5],
    'Price_per_unit': [75, 63, 32, 13,None],
    'Store': ['Kirana Express', 'Daily Mart', 'Fresh Market', 'Bitthal_Market','Govindpura'],
    'Payment_Method': ['Cash', 'UPI', 'Cash', 'UPI', 'Cash'],
    'Date': ['2025-08-01', '2025-08-02','2025-08-03','2025-08-04','2025-08-05'],
    'Total_Amount': [450,None, 96, 104, 400]
})
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
1,Nisha,Sugar,3,63.0,Daily Mart,UPI,2025-08-02,NaN
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0
4,talib,None,5,NaN,Govindpura,Cash,2025-08-05,400.0

In [192]:
shop=shopping_df1["Product"].dropna().reset_index()
shop

   index Product
0      0    Rice
1      1   Sugar
2      2    Rice
3      3   Sugar

In [193]:
shopping_df1["Price_per_unit"].dropna()

0    75.0
1    63.0
2    32.0
3    13.0
Name: Price_per_unit, dtype: float64

In [194]:
shopping_df1.dropna()

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0

In [195]:
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
1,Nisha,Sugar,3,63.0,Daily Mart,UPI,2025-08-02,NaN
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0
4,talib,None,5,NaN,Govindpura,Cash,2025-08-05,400.0

In [196]:
shopping_df1.fillna("0")

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
1,Nisha,Sugar,3,63.0,Daily Mart,UPI,2025-08-02,0
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0
4,talib,0,5,0,Govindpura,Cash,2025-08-05,400.0

In [199]:
shopping_df1["Product"].fillna("Unknown")

0       Rice
1      Sugar
2       Rice
3      Sugar
4    Unknown
Name: Product, dtype: object

In [200]:
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
1,Nisha,Sugar,3,63.0,Daily Mart,UPI,2025-08-02,NaN
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0
4,talib,None,5,NaN,Govindpura,Cash,2025-08-05,400.0

In [201]:
shopping_df1.fillna("Unknown")

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
1,Nisha,Sugar,3,63.0,Daily Mart,UPI,2025-08-02,Unknown
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0
4,talib,Unknown,5,Unknown,Govindpura,Cash,2025-08-05,400.0

In [204]:
shopping=shopping_df1.rename(columns={"Customer":"Name","Store":"Place"})

In [205]:
shopping

,Name,Product,Quantity,Price_per_unit,Place,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
1,Nisha,Sugar,3,63.0,Daily Mart,UPI,2025-08-02,NaN
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0
4,talib,None,5,NaN,Govindpura,Cash,2025-08-05,400.0

In [206]:
shopping_df1.describe()

       Quantity  Price_per_unit  Total_Amount
count   5.00000        4.000000      4.000000
mean    5.00000       45.750000    262.500000
std     2.12132       28.371053    188.774115
min     3.00000       13.000000     96.000000
25%     3.00000       27.250000    102.000000
50%     5.00000       47.500000    252.000000
75%     6.00000       66.000000    412.500000
max     8.00000       75.000000    450.000000

In [207]:
shopping_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer        5 non-null      object
 1   Product         4 non-null      object
 2   Quantity        5 non-null      int64
 3   Price_per_unit  4 non-null      float64
 4   Store           5 non-null      object
 5   Payment_Method  5 non-null      object
 6   Date            5 non-null      object
 7   Total_Amount    4 non-null      float64
dtypes: float64(2), int64(1), object(5)
memory usage: 452.0+ bytes

In [208]:
shopping_df1.head(2)

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
1,Nisha,Sugar,3,63.0,Daily Mart,UPI,2025-08-02,NaN

In [209]:
shopping_df1.tail(3)

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0
4,talib,None,5,NaN,Govindpura,Cash,2025-08-05,400.0

In [210]:
shopping_df1.shape

(5, 8)

In [211]:
shopping_df1.size

40

In [212]:
shopping_df1.columns

Index(['Customer', 'Product', 'Quantity', 'Price_per_unit', 'Store',
       'Payment_Method', 'Date', 'Total_Amount'],
      dtype='object')

In [213]:
shopping_df1.index

RangeIndex(start=0, stop=5, step=1)

In [214]:
shopping_df1["Total_Amount"].array

<NumpyExtensionArray>
[np.float64(450.0),   np.float64(nan),  np.float64(96.0), np.float64(104.0),
 np.float64(400.0)]
Length: 5, dtype: float64

In [217]:
print(shopping_df1["Product"].dtype)

object

In [218]:
shopping_df1.ndim

2

In [219]:
shopping_df1.nunique()

Customer          4
Product           2
Quantity          4
Price_per_unit    4
Store             5
Payment_Method    2
Date              5
Total_Amount      4
dtype: int64

In [221]:
print(shopping_df1["Quantity"].unique)

<bound method Series.unique of 0    6
1    3
2    3
3    8
4    5
Name: Quantity, dtype: int64>

In [223]:
shopping_df1.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [224]:
shopping_df1

,Customer,Product,Quantity,Price_per_unit,Store,Payment_Method,Date,Total_Amount
0,Raj,Rice,6,75.0,Kirana Express,Cash,2025-08-01,450.0
1,Nisha,Sugar,3,63.0,Daily Mart,UPI,2025-08-02,NaN
2,Nisha,Rice,3,32.0,Fresh Market,Cash,2025-08-03,96.0
3,Priya,Sugar,8,13.0,Bitthal_Market,UPI,2025-08-04,104.0
4,talib,None,5,NaN,Govindpura,Cash,2025-08-05,400.0

In [226]:
shop=shopping_df1["Total_Amount"].agg(["sum","min","mean"])
shop

sum     1050.0
min       96.0
mean     262.5
Name: Total_Amount, dtype: float64

In [228]:
shop1=shopping_df1.groupby("Customer")["Product"].sum().reset_index()
shop1

  Customer    Product
0    Nisha  SugarRice
1    Priya      Sugar
2      Raj       Rice
3    talib          0